# 52 - Transformasi Kolom Menjadi Baris pada Pandas Data Frame

## Import Modules

### Module yang digunakan :
1. pandas

In [1]:
import pandas as pd

- Mengecheck versi dari module yang digunakan yaitu pandas

In [2]:
print(pd.__version__)

1.0.5

## Membuat Data Frame

Membuat data set yang berisikan dictionary yang terdiri dari pasangan keys yang akan menjadi nama kolom (kode_area, pabrik, gudang, dan toko) beserta valuesnya.

In [5]:
d = {
'kode_area': [123, 456, 789, 321],
'pabrik': [4, 2, 5, 0],
'gudang': [2, 4, 7, 3],
'toko': [64, 32, 15, 24]
}

df = pd.DataFrame(d)
df

   kode_area  pabrik  gudang  toko
0        123       4       2    64
1        456       2       4    32
2        789       5       7    15
3        321       0       3    24

## Transformasi Kolom Menjadi Baris

Fungsi `melt()` dapat digunakan untuk mentranformasikan kolom menjadi baris yang perlu disertai oleh 3 parameter yaitu 
> `id_vars` yang mengacu kepada kolom unik/primary dari suatu data frame.

> `var_name` untuk menentukan nama kolom baru yang menampung hasil dari tranformasi kolom menjadi baris.

> `value_name` untuk menentukan nama kolom baru yang akan menampung nilai dari setiap kolom yang ditranformasikan.

- Melakukan tranformasi kolom `pabrik, gudang, dan toko` menjadi suatu baris yang akan ditampung oleh `jenis bangunan`.
- Membuat kolom `jumlah` untuk menampung setiap nilai yang ditampung pada kolom `pabrik, gudang, dan toko`.

In [4]:
df = df.melt(id_vars='kode_area', 
             var_name='jenis_bangunan', 
             value_name='jumlah')
df

    kode_area jenis_bangunan  jumlah
0         123         pabrik       4
1         456         pabrik       2
2         789         pabrik       5
3         321         pabrik       0
4         123         gudang       2
5         456         gudang       4
6         789         gudang       7
7         321         gudang       3
8         123           toko      64
9         456           toko      32
10        789           toko      15
11        321           toko      24